Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ལམ་དེ་ནས་མདའ་རྒྱང་གང་ཚུན་ཆད་ཙམ་མེ་ཏོག་ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོས་ཁེབས་ཤིང་ངུར་པ་སྒྲ་འབྱིན་པར་བྱས་སོ། ། ལམ་དེར་གསེར་གླེབས་པས་རབ་ཏུ་གཡོགས་སོ། ། ལམ་དེ་གསེར་གྱི་དྲ་བ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་དྲ་བས་རབ་ཏུ་གཡོགས་སོ། ། དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོས་ལམ་དུ་དེ་ལྟ་བུའི་བཀོད་པ་བྱས་ནས་ལུས་ཆེན་པོ་མངོན་པར་སྤྲུལ་ཏེ། འཁོར་དང་བཅས་པ་དགའ་མགུ་རངས་རབ་ཏུ་དགའ་སྟེ། མོས་ཤིང་ཡིད་བདེ་བ་སྐྱེས་ནས། དགའ་བའི་སེམས་དང་། བདེ་བའི་སེམས་དང་། མཉེན་པའི་སེམས་དང་། རྣམ་པར་དང་བའི་སེམས་དང་། སྒྲིབ་པ་མེད་པའི་སེམས་དང་། རབ་ཏུ་སིམ་པའི་སེམས་དང་། སངས་རྒྱས་ལ་གཞོལ་བའི་སེམས་དང་། ཆོས་ལ་གཞོལ་བའི་སེམས་དང་། དགེ་འདུན་ལ་གཞོལ་བའི་སེམས་དང་། བྱང་ཆུབ་ལས་མི་གཡོ་བའི་སེམས་དང་། མི་བསྐྱོད་པའི་སེམས་དང་། མི་མཉམ་པ་དང་མཉམ་པའི་སེམས་དང་། འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་སེམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་དང་། སྙིང་རྗེའི་སེམས་དང་། དགའ་བའི་སེམས་དང་། བཏང་སྙོམས་ཀྱི་སེམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྣོད་དུ་གྱུར་པའི་སེམས་དང་། སྙིང་པོའི་སེམས་དང་། བརྟན་པའི་སེམས་དང་། མི་ཕྱེད་པའི་སེམས་དང་། མ་ཞིགས་པའི་སེམས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་མི་ལྟུང་བའི་སེམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་བསྒྲུབ་པའི་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ ཕྱིན་ནས བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ ། ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: Then, having prepared the path in this fashion, the yakṣa Śaila, Kimbhīra’s son, displayed a material body, which pleased, excited, and delighted the crowd. When he had brought joy to the crowd and put them in good spirits, he approached the Lord in a joyful state of mind, in a happy state of mind, in a gentle state of mind, in a faithful state of mind, in an untroubled state of mind, and in a delighted state of mind, his mind drawn to the Buddha, his mind drawn to the Dharma, his mind drawn to the Saṅgha, and his mind not wavering from awakening, undisturbed, and not indifferent to awakening, with a mind esteemed in all the three worlds, with a loving mind, a compassionate mind, a joyous mind, and a mind of equanimity for all sentient beings, with a mind that was a fitting vessel for all the Buddha’s teachings, a firm mind, a stable mind, an undivided mind, a nondecaying mind, and with an attitude that did not fall to the level of śrāvakas or pratyekabuddhas but had the motivation to attain all the stages of the bodhisatva path. He approached the Lord and saluted him by bowing the head to his feet, circumambulated him three times clockwise, and then stood to one side. Standing there, the yakṣa Śaila, Kimbhīra’s son, joined his hands and addressed the Lord in verse:

source: སངས་རྒྱས་འཇིག་རྟེན་རྣམས་ཀྱི་མཆོག །ཆོས་རྣམས་ཀྱི་ནི་དམ་པ་སྟོན། ། འཇིག་རྟེན་མགོན་ལ་བདག་གིས་ནི། །བླ་ན་མ་མཆིས་མཆོད་པ་བགྱིས། །
en: “May these supreme and genuine acts Of worship for the protector of the world Lead me to become a supreme buddha, A teacher of the supreme Dharma.

source: འདྲེན་པ་ཇི་ལྟར་མཛད་པ་བཞིན། །སྟོབས་བཅུ་དང་ནི་རབ་ལྡན་ཏེ། །
en: “Possessing the ten powers And firmly supported by confidence,

source: མི་འཇིགས་པ་ལ་རབ་གནས་ནས། །སེམས་ཅན་དོན་རྣམས་བགྱིད་པར་ཤོག །
en: May I soon bring benefit to living beings Just as you do, O guide!

source: སུམ་ཅུ་རྩ་གཉིས་མཚན་རྣམས་དང་། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུར་ལྡན། །
en: “May I be endowed with the thirty-two characteristics And eighty minor marks.

source: འཇིག་རྟེན་མགོན་པོ་འོད་བྱེད་པ། །འཇིག་རྟེན་སྣང་བ་བྱེད་པར་ཤོག །
en: May I become a light for the world, A radiant protector of the world.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །སྙན་པའི་ཆོས་ནི་རབ་སྟོན་ཅིང་། །རྣམ་པ་བཅུ་གཉིས་དམ་པ་ཡི། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་ཤོག །
en: “May I turn the wheel of the Dharma With its twelve unsurpassed forms. May I teach the sweet Dharma That benefits all who live.

source: རྒྱལ་བ་ཇི་ལྟ་དེ་བཞིན་དུ། །ཆོ་འཕྲུལ་རྣམས་ནི་རབ་སྟོན་ཅིང་། །སྲོག་ཆགས་བྱེ་བ་དུ་མ་ཡི། །སེམས་ཅན་རྣམས་ཀྱི་དོན་བགྱིད་ཤོག །
en: “May I be able to display miracles In the same manner as the Victorious One So that I may be of benefit To many millions of living beings.

source: དཔའ་ཆེན་གང་རྣམས་མ་བྱོན་པ། །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་ལྟར། །བྱང་ཆུབ་དམ་པ་རབ་རྟོགས་ནས། །
en: “Like the great heroes yet to come, The protectors of the world, the illuminators, May I teach the path After having realized unsurpassed awakening.

source: ལམ་དེ་རབ་ཏུ་སྟོན་པར་ཤོག །སེམས་ཅན་ལྡོངས་པ་ཀུན་གྱི་ཕྱིར། །མིག་དང་ལྡན་པ་ཉིད་གྱུར་ཏེ། །གནས་དང་རྟེན་དང་སྐྱབས་དག་དང་། །
en: “May I be a resting place, a shelter, A refuge, and an ultimate sanctuary. May I be one who can see For all blind sentient beings.

source: དེ་བཞིན་དཔུང་གཉེན་འགྱུར་བར་ཤོག །ཇི་ལྟར་འདྲེན་པ་གྲོལ་མཛད་བཞིན། །འགྲོ་བ་ལྔར་ནི་སྐྱེས་པ་ཡི། །སྲོག་ཆགས་རྣམས་ཀྱི་མགོན་དུ་ཤོག ། བདག་གིས་སྡུག་བསྔལ་ཀུན་ལས་དགྲོལ། །
en: “May I be a protector for living beings In the five realms. May I liberate them from all suffering, Just like you. O guide, grant liberation!

source: འཇིག་རྟེན་ན་ནི་མཚུངས་པ་ཡོད་མེད་པ། །ལྷ་དབང་ལྷ་མ་ཡིན་དང་ཀླུས་མཆོད་པ། །གཟི་བརྗིད་དག་ནི་མཐའ་ཡས་འོད་མཛད་པ། །རྐང་གཉིས་མཆོག་ལ་བདག་གིས་མཆོད་པ་བགྱིས། །
en: “The worship I have offered to the greatest of those who walk on two feet, To the boundless light, to the illuminator, Cannot be matched by any acts of worship Performed by powerful gods, nāgas, or asuras.

source: བདག་ནི་ལས་མཆོག་དམ་པ་འདི་དག་གིས། །མི་དབང་ས་སྟེང་མཆོག་ཏུ་གྱུར་པ་བཞིན། །བསོད་ནམས་རབ་མཆོག་སུམ་ཅུ་གཉིས་མཚན་ལྡན། །ཆོས་ཀྱི་བདག་པོ་དེ་དང་འདྲ་བར་ཤོག །
en: “By the acts here performed, May I become a lord of the Dharma Possessing the thirty-two supreme characteristics of excellent merit, Like the lord of men, unmatched in this world.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོ་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་གསུངས་པ། ཆོས་ཀྱི་དམ་པ་རྣམས་ཀྱི་ཕྱིར། །སྟོན་པའི་རིམ་གྲོ་གང་བྱེད་པ། །སེམས་ཅན་རྣམས་ཀྱི་མཆོག་ཡིན་ཏེ
en: The Lord then spoke these verses to the yakṣa Śaila: “Those who show reverence to the teacher, The originator of the supreme teachings— They become the best among beings.

source: དེ་དག་བྱང་ཆུབ་རྙེད་མི་དཀའ། །
en: For them, awakening will not be hard to reach.

source: འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ། །འཇིག་རྟེན་སྣང་མཛད་མཆོག་ལ་ནི། །ལྷ་དང་ཀླུ་དང་མི་རྣམས་ཀྱིས། །མཆོད་པ་བྱ་བར་འོས་པར་འགྱུར། །
en: “One who has worshiped the light of the world, The protector of the world, the illuminator— He himself becomes worthy of being worshiped By gods, nāgas, and men.

source: བྱང་ཆུབ་མཆོག་ཏུ་སངས་རྒྱས་ནས། །
en: “He realizes supreme awakening

source: ཤིང་མཆོག་དྲུང་དུ་རབ་འདུག་སྟེ། །
en: Seated at the foot of the greatest of trees.

source: སྡིག་ཅན་བདུད་ལས་རྒྱལ་ནས་སུ། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: He conquers the Evil One, And teaches the Dharma to living beings.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལྷ་སྟོང་ཕྲག་དུ་མ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་སྟོང་ཕྲག་དུ་མ་དང་། དྲི་ཟ་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་སྟོང་ཕྲག་དུ་མ་དང་། །མི་དང་མི་མ་ཡིན་པ་སྟོང་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། །སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་གཟི་བརྗིད་ཆེན་པོས་འོད་ཟེར་ནི་རབ་ཏུ་འགྱེད། ཞིང་ནི་རབ་ཏུ་གཡོ་བར་བྱས། མེ་ཏོག་གི་ཆར་ནི་རབ་ཏུ་འབེབས། སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་ནི་རབ་ཏུ་འཁྲོལ་བར་བྱས་ཏེ། གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོས་ལམ་དུ་བཀོད་པ་ཇི་ལྟར་མངོན་པར་བྱས་པ་བཞིན་དུ་ཤིང་རྟའི་འཕང་ལོ་ཙམ་གྱི་པད་མ་ལ་ཞབས་བཞག་སྟེ། རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་གདན་མཆོག་ཆོས་ཀྱི་གདན། གདན་དམ་པ། གདན་བཟང་པོ། འཇིག་རྟེན་གསུམ་པོ་ཀུན་ལས་ཁྱད་པར་དུ་འཕགས་པའི་གདན། སངས་རྒྱས་ཀྱི་གདན་ཤོམས་ཤིག །དེ་བཞིན་གཤེགས་པ་གདན་དེ་ལ་བཞུགས་ཏེ སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་རྣམས་ལ་སྙིང་བརྩེ་བ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བའི་མདོ་སྡེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་རབ་ཏུ་བསྔགས་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱུ་འཐུན་པ་འཆད་པར་འགྱུར་ཏེ དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཐེ་ཚོམ་དུ་གྱུར་པ་ལ་རབ་ཏུ་སྟོན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅོད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་སྐྱེ་བ་གཅོད་པ། དེ་བཞིན་གཤེགས་པའི་མདོ་སྡེ་འདི་འཆད་པར་འགྱུར་རོ། །
en: The Lord was then surrounded and honored by many thousands of gods, by many thousands of yakṣas and rākṣasas, by many thousands of gandharvas, kinnaras, and mahoragas, by many thousands of human and nonhuman beings, and by many hundreds, thousands, millions, and billions of beings. By the tremendous power of the buddhas, by the tremendous magical abilities of the buddhas, by the tremendous miraculous abilities of the buddhas, by the tremendous transformative abilities of the buddhas, and by the tremendous splendor of buddhas, he emitted rays of light. The earth shook, flowers rained down, a hundred thousand million billion musical instruments resounded. He placed his feet down on lotus flowers the size of cart wheels, and on the path that had been prepared by the yakṣa Śaila, Kimbhīra’s son, he made his way to Vulture’s Peak, the king of mountains. When he arrived there, he said to the venerable Ānanda, “Ānanda! Prepare a seat for the Tathāgata, a seat of the Dharma, a choice seat, an excellent seat, a seat that will be celebrated throughout the three worlds, a seat for the Buddha. The Tathāgata will take his seat there and present a sūtra that is praised as being of benefit to all sentient beings. It is called The Collected Teachings on the Bodhisatva, and its natural result is the path of the bodhisatva. He will present this sūtra of the Tathāgata to address and to eliminate the doubts of all sentient beings, to eliminate any doubts that sentient beings may have, to help a great many beings, to delight a great many beings, out of compassion for the world, to benefit, to help, and to delight gods and men.”

source: ཞེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་གདན་བཤམས་ཏེ། དེ་ན་ལྷ་བྱེ་བ་དྲུག་ཅུ་རྩ་བརྒྱད་ཀྱིས་རས་བཅོས་མ་རེ་རེ་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ཏེ། དེ་དག་ཀྱང་དེར་གདན་དུ་བཏིང་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་དེ་ལ་བཞུགས་སོ། །
en: The venerable Ānanda prepared the Lord’s seat, and six hundred eighty million gods each made an offering of cloth to the Tathāgata, placing it on his seat. The Lord then sat down on the seat that had been prepared for him. When he had sat down, the Lord spoke these verses to the gods:

source: བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་རྣམས་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་གསུངས་པ། །འཇིག་རྟེན་མགོན་གྱི་གདན་དུ་ནི། །ལྷ་ཡི་གོས་རབ་དམ་པ་མཆོག །ལྷ་ཡིས་རབ་ཏུ་བཏིང་བ་ལ། །དེ་ལ་རྣམ་པར་འདྲེན་པ་བཞུགས། །ཐམས་ཅད་ཆོས་ཀྱི་ཕ་རོལ་ཕྱིན། །སངས་རྒྱས་བཞུགས་པར་གྱུར་མ་ཐག །
en: “Superior, superb, excellent Divine cloth has been presented By the gods to the protector of the world, And here the guide has taken his seat. “The Buddha has taken his seat. He has thoroughly mastered all the teachings.

source: འཇིག་རྟེན་རྣམ་པ་དྲུག་གཡོས་ཤིང་། །སྐྱེ་བོ་རབ་ཏུ་དགའ་བར་གྱུར། །
en: The sixfold world trembled, And he brought delight to living beings.

source: སངས་རྒྱས་ཞིང་ནི་རི་དང་བཅས། །དེ་ན་རབ་ཏུ་སྣང་བར་གྱུར། །དེ་ན་ཆོས་འདོད་རྣམས་ལ་ནི། །སྐྱོབ་པ་སངས་རྒྱས་རྫུ་འཕྲུལ་སྟོན། །
en: “His buddha field With its mountains Is illuminated when the Buddha Who works wonders, the guide, Teaches those who long for the Dharma.

source: ལྷ་དང་ཀླུ་དང་མི་རྣམས་དང་། །གྲུལ་བུམ་ཡི་དགས་སྲུལ་པོ་རྣམས། །དེ་དག་གཅིག་གིས་གཅིག་མཐོང་སྟེ། །
en: “When gods, nāgas, and human beings, Kumbhāṇḍas, pretas, and pūtanas, See him in their turn,

source: སྒྲིབ་པ་དག་ནི་མེད་པར་གྱུར། །
en: Their obscurations are no more.

source: ལྷ་རྣམས་བྱེ་བ་ཕྲག་སྟོང་དང་། །ཁྲག་ཁྲིག་ཕྲག་ནི་བརྒྱ་རྣམས་དག །
en: “A hundred thousand million billion gods Look with delight Upon the Buddha who utters Words so hard to find.

source: རྙེད་དགའ་ཡི་ནི་ཚིག་གསུང་བ། །སངས་རྒྱས་ལ་ནི་དགའ་བས་ལྟ། །རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ཡང་། །དེ་ཚེ་བློན་པོས་ཡོངས་བསྐོར་ཅིང་།
en: “Once even the king Bimbisāra, Together with his ministers, Came to meet the protector of the world, The perfect Buddha.

source: །འཇིག་རྟེན་གྱི་ནི་མགོན་པོ་མཆོག །སངས་རྒྱས་དྲུང་དུ་འོངས་པར་གྱུར། །སྟོན་པས་ལྷ་དང་ཀླུ་རྣམས་དང་། །མི་རྣམས་འདུས་པར་མཁྱེན་པ་དང་། །
en: “The teacher, seeing those who have assembled— Gods, nāgas, and human beings— Looks in all directions In order to help all living beings.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ཕྱོགས་བཞི་དག་ཏུ་རབ་གཟིགས་ནས། །འཇིག་རྟེན་ཐེ་ཚོམ་གང་ཡོད་པ། །རྐང་གཉིས་མཆོག་ལ་དྲིས་ཤིག་དང་། །ཐེ་ཚོམ་དག་ནི་དྲིས་པ་རྣམས། །རྣམ་པར་འདྲེན་པ་ངས་བཤད་དོ། །
en: “Whoever harbors doubts in this world, Ask now the greatest of those who walk on two feet. I, the guide, will eliminate The uncertainties of any who ask.”

source: དེ་ལྟར་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་འདུས་ནས། ཆོས་ཉན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་དལ་བར་ཤེས་ནས། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ཏེ། ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་རྣ་བ་བླགས་ཏེ་འདུག་པར་གྱུར་ཏོ། །
en: Then, beings from the threefold thousand great thousand worlds gathered. Realizing the great opportunity they now had to hear the Dharma, they all bowed. Then, motivated by compassion, they sat down and listened attentively to the teaching.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཆེན་པོ་དགེ་སློང་མ་འདུས་པ་རྣམས་ལ་སོམས་ལ། མ་ལྷགས་པ་རྣམས་ཀྱང་ཚོལ་ཏེ། རྒྱང་རིང་པོ་ན་གནས་པ་རྣམས་ཀྱང་སྡུས་ཤིག །
en: The Lord then addressed the venerable Mahāmaudgalyāyana: “Maudgalyāyana, focus your attention on the assembled mendicants. Find out who is not here and have those who are far away appear here.”

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་གྱི་ལྷོ་ཕྱོགས་ཀྱི་ངོས་ལ་གནས་སོ། ། དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བསམས་ཏེ། བསམས་ནས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། ། བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ལོངས་ཤིག །བཅོམ་ལྡན་འདས་འདི་ལྟར་ལྷར་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་དུ་བཅས་པ་དང་། ཚངས་པར་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་རྣམས་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཁོར་གྱི་མདུན་དུ་ཆོས་སྟོན་ཏེ། སྟོན་པས་བཀའ་སྩལ་གྱིས། བཙུན་པ་འོད་སྲུང་བདག་ཅག་གཉིས་ཀྱི་ཆོས་ཀྱི་བར་ཆད་དུ་འགྱུར་དུ་འོང་གིས་འདོང་ངོ་། །
en: At that time, the venerable Mahākāśyapa was staying on the southern slopes of Himavat, the king of mountains. The venerable Mahāmaudgalyāyana concentrated his attention, and when he had done so he traveled by means of his magical powers to the place where the venerable Mahākāśyapa was staying. When he arrived there, he said this to the venerable Mahākāśyapa: “Brother Mahākāśyapa! The Lord is teaching the Dharma to an assembly of the whole world, with its gods, with its māras, with its brahmā gods, with its ascetics and brahmins, and with its gods, human beings, and asuras. Come with me, Brother Mahākāśyapa! The Lord has urged you to come, saying, ‘Let there be no hindrances to our Dharma activity!’ ”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཁྱོད་སོང་ཤིག་དང་། ཁོ་བོ་ཡང་ཁྱོད་སོང་བའི་རྗེས་བཞིན་དུ་འོང་ངོ་། །
en: When the venerable Mahāmaudgalyāyana had spoken, the venerable Mahākāśyapa replied to him: “Go on ahead, Venerable Mahāmaudgalyāyana. I will follow after you when you have left.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་སྟན་དེ་ལ་འཕྲུལ་བ་སྤྲུལ་ཏེ། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཞུགས་སོ། ། དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་འཁོར་བཞིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོར་གྱི་ནང་དུ་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །
en: The venerable Mahākāśyapa then magically transported himself to Vulture’s Peak, the king of mountains, accompanied by a fourfold entourage. When he arrived there, he saluted the Lord by bowing the head to his feet and sat down in the audience not too far from the Lord.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་སྤྲུལ་པ་དེ་མཐོང་ནས། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་འཁོར་གྱི་ནང་ན་ཕྱོགས་གཅིག་ཏུ་འདུག་པར་མཐོང་སྟེ མཐོང་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། ། བཙུན་པ་འོད་སྲུང་ཁྱོད་སྟན་ག་ལ་བ་དེ་ནས་སྤྲུལ་ཏེ། སྤྲུལ་ནས་མགྱོགས་པར་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་ཕྱིན་ཏེ། སྤྱན་སྔར་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་འཁོར་གྱི་ནང་ན་ཕྱོགས་གཅིག་ཏུ་འདུག་པ་ནི་མྱུར་བ་ལ་སྟེན་པའི་རྫུ་འཕྲུལ་དང་ལྡན་ནོ། །
en: The venerable Mahāmaudgalyāyana traveled to the place where the Lord was by means of his own magical powers, and he saw the venerable Mahākāśyapa there, already seated in the audience to one side, not too far from the Lord. When he saw him, he said, “You are indeed blessed with swiftness, Brother Mahākāśyapa, as with your magical powers you can travel from your dwelling place and arrive as quickly as this and be seated in the audience not too far from the Lord.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་ཏུ་གསུངས་ན་འདི་ལ་ཁོ་བོའི་རྫུ་འཕྲུལ་རྣམ་པར་སྤྲུལ་པ་ལྟ་ཅི་ཞིག་ཏུ་འགྱུར།
en: When this had been said, the venerable Mahākāśyapa replied to the venerable Mahāmaudgalyāyana: “The Lord has said that you, Venerable Mahāmaudgalyāyana, are the foremost when it comes to magical powers, so why even speak of my magical powers of transformation in this connection?”

source: གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་ལེའུ་སྟེ་གཉིས་པའོ།། །།
en: This is the second chapter, “The Yakṣa Kimbhīra.”

source: བམ་པོ་གསུམ་པ།
en: Chapter 3:

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: The venerable Śāriputra got up from his seat, placed his robe over one shoulder, knelt down on his right knee, joined his hands in reverence, and spoke to the Lord: “I would like to ask the Lord, the tathāgata, arhat, fully accomplished Buddha, for some direction, if the Lord will grant that possibility with an explanation of the question when asked.”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། ཤཱ་རིའི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས་ངས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: The Lord answered the venerable Śāriputra, “You may ask the tathāgata, arhat, fully accomplished Buddha whatever you like, Śāriputra, and I will delight your mind by explaining whatever it is you wish to ask about.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་ཆོས་དུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལུས་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་མ་མཆིས་པ་དག་ལགས། ངག་གི་ལས་ཁོ་ན་མ་ཐོ་བ་མ་མཆིས་པ་དང་། ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་མ་མཆིས་པ་དང་། ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་དང་། ངག་གི་ལས་ཡོངས་སུ་དག་པ་དང་། ཡིད་ཀྱི་ལས་ཡོངས་སུ་དག་པ་དང་། ལུས་ཀྱི་ལས་མ་གཡོས་པ་དང་། ངག་གི་ལས་མ་གཡོས་པ་དང་། ཡིད་ཀྱི་ལས་མ་གཡོས་པ་རྣམས་ལགས། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དེ་ལས་བདུད་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བསྐྱོད་མི་ནུས་པ་རྣམས་ལགས། ས་ནས་སར་འཕར་བ་ལ་མཁས་པ་རྣམས་ལགས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདྲེན་པར་གྱུར་པ་དང་། རྣམ་པར་འདྲེན་པར་གྱུར་པ་དང་། ཡོངས་སུ་འདྲེན་པར་གྱུར་པ་དང་། སྒྲོན་མར་གྱུར་པ་དང་། སྟེགས་སུ་གྱུར་པ་དང་། ཟམ་པར་གྱུར་པ་དང་། གྲུར་གྱུར་པ་དང་། སྒྲོལ་བ་པོ་དང་། ཕ་རོལ་དུ་འགྲོ་བར་གྱུར་པ་དང་། གནས་དང་མགོན་དང་སྐྱབས་དང་། དཔུང་གཉེན་དུ་གྱུར་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དེ་ལས་བཟློག་པར་མི་ནུས་པ་རྣམས་ལགས།
en: The venerable Śāriputra then asked the Lord, “Lord, what qualities do the bodhisatvas, the great beings, possess that lead them to act irreproachably in body, to act irreproachably in speech, to act irreproachably in thought; that make them immaculate in body, immaculate in speech, immaculate in thought; that make them unshakeable in body, unshakeable in speech, unshakeable in thought? Neither Māra and his retinue nor the gods are able to disturb them when they have made up their mind to reach omniscience. They progress with skill from stage to stage and are not soiled by worldly phenomena. They act as leaders, mentors, guides, torches, fords, bridges, boats, and ferrymen who carry living beings to the other shore. They are places of rest, shelters, refuges, and ultimate sanctuaries for all sentient beings. As they have made up their minds to reach omniscience, they will never be turned from their course.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་དོན་དེ་ཉིད་ཀུན་ཞུས་པ། །གང་གིས་བྱང་ཆུབ་རབ་ཞུགས་པ། །དཔའ་བོ་དེ་ཡི་དོན་ཅི་ལགས། །གང་གིས་དམ་པ་འཚང་རྒྱ་བ། །ཡོན་ཏན་ཆོས་རྣམས་བརྗོད་དུ་གསོལ། །
en: The venerable Śāriputra then questioned the Lord by singing these verses: “With what purpose do these heroes Set out to reach awakening? Tell us of the virtuous qualities Through which they attain supreme realization.

source: སྲོག་ཆགས་ཀུན་ལ་སྨན་སླད་དུ། །དཔའ་བོ་དེ་དག་ཇི་ལྟར་སྤྱོད། །
en: “How do these heroes act For the benefit of all who live?

source: ཇི་ལྟ་བུ་ཡི་ཆོས་བསྒོམས་པས། །མི་ཡི་དམ་པ་སངས་རྒྱས་འགྱུར། །
en: How do they practice the Dharma To become buddhas, the best of men?

source: བྱང་ཆུབ་སྙིང་པོར་རབ་གནས་ནས། །
en: “When they are established on the seat of awakening,

source: སྡིག་ཅན་དག་ནི་ཇི་ལྟར་འདུལ། །བྱེ་བ་དག་གི་ཞིང་བསྐྱོད་ནས། །
en: How do they subdue the Evil One? And how, after having shaken ten million fields,

source: ཇི་ལྟར་བྱང་ཆུབ་མཆོག་འཚང་རྒྱ། །
en: Do they attain ultimate awakening?

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གི་དོན། །འདི་འདྲའི་ཚིག་ནི་ཅི་ཞིག་ལགས། །སངས་རྒྱས་ཆོས་ཀྱི་མཆོག་རྣམས་དང་། །བྱང་ཆུབ་དག་ནི་འདིར་བརྗོད་གསོལ། །
en: “What does the word bodhisatva mean? What sort of term is this? Tell us, too, about awakening And the supreme qualities of the buddhas.

source: སྲོག་ཆགས་ཀུན་ལས་སྨན་སླད་དུ། །པད་མ་བཞིན་དུ་མ་ཆགས་ཤིང་། །སེམས་ཅན་བྱེ་བ་གྲོལ་མཛད་པར། །འཇིག་རྟེན་འདི་ནི་ཇི་ལྟར་སྤྱོད། །
en: “How do they act in this world For the benefit of all who live, Undefiled like the lotus, Liberating countless living beings?

source: མཁས་པ་ལྷ་དང་ཀླུ་དག་དང་། །མི་དང་མི་མ་ལགས་རྣམས་ཀྱིས། །ཇི་ལྟ་བུར་ནི་མཆོད་འགྱུར་བ། །ཞུས་པ་དེ་དག་བཤད་དུ་གསོལ། །
en: “How are the learned ones Honored by gods and nāgas, By human and nonhuman beings? Please explain what I have asked about.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཅིག་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་འདི་དག་དང་གཞན་ཡང་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་འཛིན་ཏོ། ། ཆོས་གཅིག་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཏེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཅིག་པོ་དེ་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་འདི་དག་དང་། གཞན་ཡང་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་འཛིན་ཏོ། །
en: The Lord spoke to the venerable Śāriputra: “Śāriputra, there is a single quality that the bodhisatva possesses through which he attains the other immeasurable buddha qualities. What is this single quality? Śāriputra, this single quality that the bodhisatva possesses, through which he attains the other immeasurable buddha qualities, is that he has as his foundation the resolve of the mind of awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བསམ་པ་ཇི་ལྟ་བུ། བྱང་ཆུབ་ཀྱི་སེམས་ཇི་ལྟ་བུ།
en: The venerable Śāriputra then asked the Lord, “Lord, what kind of resolve is this? What is the mind of awakening like?”
